By: RETBOT
// TELNET
Router>ena
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#host TELNET
TELNET(config)#int fa 0/0
TELNET(config-if)#ip add 192.168.0.1 255.255.255.0
TELNET(config-if)#no sh

TELNET(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

TELNET(config-if)#exit
TELNET(config)#line vty 0 2
TELNET(config-line)#pass
TELNET(config-line)#password LONCHE
TELNET(config-line)#login
TELNET(config-line)#exit
TELNET(config)#enable secret MIXTO
TELNET(config)#do wr
Building configuration...
[OK]
TELNET(config)#do sh run
Building configuration...
By: RETBOT
// Desde terminal para entrar al router COMEDOR
telnet 192.168.0.1 

contraseña: LONCHE 
contraseña Administrador: MIXTO



// P7 SSH
Router>ena
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#host SSH
SSH(config)#int fa 0/0
SSH(config-if)#ip add 192.168.0.1 255.255.255.0
SSH(config-if)#no sh

SSH(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
By: RETBOT
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

SSH(config-if)#exit
SSH(config)#ip domain-name sistemas.com
SSH(config)#crypto key generate rsa
The name for the keys will be: SSH.sistemas.com
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 512
% Generating 512 bit RSA keys, keys will be non-exportable...[OK]

SSH(config)#ip ssh time-out 15
*Mar 1 0:10:10.313: RSA key size needs to be at least 768 bits for ssh version 2
*Mar 1 0:10:10.313: %SSH-5-ENABLED: SSH 1.5 has been enabled
SSH(config)#ip ssh au
SSH(config)#ip ssh authentication-retries 3
SSH(config)#username PEQUE password 12345
SSH(config)#line vty 0 2
SSH(config-line)#password CISCO
SSH(config-line)#exe
SSH(config-line)#exec-timeout 10
SSH(config-line)#trans
SSH(config-line)#transport input ssh
SSH(config-line)#login local
SSH(config-line)#exit
SSH(config)#banner motd "SOLO PERSONAL CHIDO"
SSH(config)#do wr
Building configuration...
[OK]
By: RETBOT

cmd 
ssh -l PEQUE 192.168.0.1 
password: 122345
SSH(config)#

username admin privilege 15 secret Firewall.cx
username "nombre usuario" privilege "numero de privilegio" secret "contraseña"
15
10
5
By: RETBOT
