Swich planta alta
Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#host SWAR
SWAR(config)#vlan 10
SWAR(config-vlan)#name ACCESS_POINT
SWAR(config-vlan)#name ACCESS_POINT_OTROS
SWAR(config-vlan)#exit
SWAR(config)#vlan 20
SWAR(config-vlan)#name CUBICULOS
SWAR(config-vlan)#exit
SWAR(config)#vlan 30
SWAR(config-vlan)#name AULA_ACTIVA
SWAR(config-vlan)#exit
SWAR(config)#vlan 40
SWAR(config-vlan)#name AULA_PROYECTOR
SWAR(config-vlan)#exit
SWAR(config)#vlan 50
SWAR(config-vlan)#name ADMINISTRATIVOS
SWAR(config-vlan)#exit
SWAR(config)#vlan 60
SWAR(config-vlan)#name MAQUINAS_INFO
SWAR(config-vlan)#exit
SWAR(config)#vlan 70
SWAR(config-vlan)#name MODULO_SERVICIO
SWAR(config-vlan)#exit
SWAR(config)#vlan 80
SWAR(config-vlan)#name VOZIP_TELEFONOS
SWAR(config-vlan)#exit
SWAR(config)#
// puerto en modo trunk
SWAR(config)#int fa 0/24
SWAR(config-if)#swi
SWAR(config-if)#switchport mode trunk

SWAR(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to up

SWAR(config-if)#swi
SWAR(config-if)#switchport tr
SWAR(config-if)#switchport trunk al
SWAR(config-if)#switchport trunk allowed vlan 10,20,30,40,50,60,70,80
SWAR(config-if)#exit
SWAR(config)#do wr
Building configuration...
[OK]
SWAR(config)#


// AULA PROYECTOR
SWAR(config)#int fa 0/1
SWAR(config-if)#switchport mode access
SWAR(config-if)#switchport access vlan 40
SWAR(config-if)#exit
SWAR(config)#

Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#host AULA_PROYECTOR
AULA_PROYECTOR(config)#vlan 40
AULA_PROYECTOR(config-vlan)#name AULA_PROYECTOR
AULA_PROYECTOR(config-vlan)#exit
AULA_PROYECTOR(config)#int range fa 0/1-24
AULA_PROYECTOR(config-if-range)#switchport mode access 
AULA_PROYECTOR(config-if-range)#switchport access vlan 40
AULA_PROYECTOR(config-if-range)#exit
AULA_PROYECTOR(config)#


// AULA ACTIVA
SWAR(config)#int fa 0/2
SWAR(config-if)#swi
SWAR(config-if)#switchport mode ac
SWAR(config-if)#switchport mode access 
SWAR(config-if)#swi
SWAR(config-if)#switchport access vlan 30
SWAR(config-if)#exit
SWAR(config)#

Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#host AULA_ACTIVA
AULA_ACTIVA(config)#vlan 30
AULA_ACTIVA(config-vlan)#int range fa 0/1-24
AULA_ACTIVA(config-if-range)#switchport mode access 
AULA_ACTIVA(config-if-range)#switchport access vlan 30
AULA_ACTIVA(config-if-range)#exit
AULA_ACTIVA(config)#

// Cubiculos
SWAR(config)#int fa 0/3
SWAR(config-if)#swi
SWAR(config-if)#switchport mode acc
SWAR(config-if)#switchport mode access 
SWAR(config-if)#swi
SWAR(config-if)#switchport acc
SWAR(config-if)#switchport access vlan 20
SWAR(config-if)#exit
SWAR(config)#

Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#host CUBICULOS
CUBICULOS(config)#vlan 20
CUBICULOS(config-vlan)#name CUBICULOS
CUBICULOS(config)#int range fa 0/1-24
CUBICULOS(config-if-range)#swi
CUBICULOS(config-if-range)#switchport mode access
CUBICULOS(config-if-range)#swi
CUBICULOS(config-if-range)#switchport access vlan 20
CUBICULOS(config-if-range)#exit
CUBICULOS(config)#

// ACCESS POINT OTROS
SWAR(config)#int fa 0/4
SWAR(config-if)#swi
SWAR(config-if)#switchport mode acc
SWAR(config-if)#switchport mode access 
SWAR(config-if)#swi
SWAR(config-if)#switchport access vlan 10
SWAR(config-if)#exit
SWAR(config)#

// Telefono
SWAR(config)#int fa 0/6
SWAR(config-if)#sw
SWAR(config-if)#switchport voice vlan 80
SWAR(config-if)#exit

// Modulo de servicio
SWAR(config)#int range fa 0/5-10
SWAR(config-if-range)#switchport mode access 
SWAR(config-if-range)#switchport access vlan 70
SWAR(config-if-range)#exit
SWAR(config)#


// Asignando vlans a puertos de ip phone en caso de conectar otra maquina directo al telefono
SWAB(config)#int range fa 0/9-10
SWAB(config-if-range)#sw
SWAB(config-if-range)#switchport mode acce
SWAB(config-if-range)#switchport mode access 
SWAB(config-if-range)#sw
SWAB(config-if-range)#switchport ac
SWAB(config-if-range)#switchport access vlan 50
SWAB(config-if-range)#exit
SWAB(config)#int fa 0/11
SWAB(config-if)#sw
SWAB(config-if)#switchport ac
SWAB(config-if)#switchport mode ac
SWAB(config-if)#switchport mode access 
SWAB(config-if)#sw
SWAB(config-if)#switchport access vlan 70
SWAB(config-if)#exit
SWAB(config)#


// maquinas info libros
SWAR(config)#int range fa 0/11-13
SWAR(config-if-range)#sw
SWAR(config-if-range)#switchport mode acc
SWAR(config-if-range)#switchport mode access 
SWAR(config-if-range)#sw
SWAR(config-if-range)#switchport acc
SWAR(config-if-range)#switchport access vlan 60
SWAR(config-if-range)#exit
SWAR(config)#

// Administrador
SWAR(config)#int fa 0/21
SWAR(config-if)#swi
SWAR(config-if)#switchport mode ac
SWAR(config-if)#switchport mode access 
SWAR(config-if)#swi

SWAR(config-if)#switchport access vlan 50
SWAR(config-if)#sw
SWAR(config-if)#switchport port-security
SWAR(config-if)#switchport port-security max
SWAR(config-if)#switchport port-security maximum 1
SWAR(config-if)#sw
SWAR(config-if)#switchport por
SWAR(config-if)#switchport port-security vio
SWAR(config-if)#switchport port-security violation sh
SWAR(config-if)#switchport port-security violation shutdown 
SWAR(config-if)#switchport port-security mac-address 00E0.A379.7447
SWAR(config-if)#

// Planta Baja
SWAR(config)#int fa 0/23
SWAR(config-if)#swi
SWAR(config-if)#switchport mode tru
SWAR(config-if)#switchport mode trunk 

SWAR(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/23, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/23, changed state to up

SWAR(config-if)#switchport trunk allowed vlan 10,20,30,40,50,60,70,80
SWAR(config-if)#

// Administrador
SWAR(config-if)#int fa 0/21
SWAR(config-if)#sw
SWAR(config-if)#switchport mode access
SWAR(config-if)#swi
SWAR(config-if)#switchport port-sec
SWAR(config-if)#switchport port-security 
SWAR(config-if)#switchport port-security  max
SWAR(config-if)#switchport port-security  maximum 1
SWAR(config-if)#switchport port-security violation shutdown 
SWAR(config-if)#switchport port-security mac-address 00E0.A379.7447
SWAR(config-if)#do wr
Building configuration...
[OK]
SWAR(config-if)#

SWAR#show port-security int fa 0/21
Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 1
Total MAC Addresses        : 1
Configured MAC Addresses   : 1
Sticky MAC Addresses       : 0
Last Source Address:Vlan   : 0002.4A1D.E476:50
Security Violation Count   : 0


// desactivar puertos 
SWAR(config)#vlan 2
SWAR(config-vlan)#name Otros
SWAR(config-vlan)#exit
SWAR(config)#int range fa 0/14-20
SWAR(config-if-range)#swi
SWAR(config-if-range)#switchport access vlan 2
SWAR(config-if-range)#sh
%LINK-5-CHANGED: Interface FastEthernet0/14, changed state to administratively down
%LINK-5-CHANGED: Interface FastEthernet0/15, changed state to administratively down
%LINK-5-CHANGED: Interface FastEthernet0/16, changed state to administratively down
%LINK-5-CHANGED: Interface FastEthernet0/17, changed state to administratively down
%LINK-5-CHANGED: Interface FastEthernet0/18, changed state to administratively down
%LINK-5-CHANGED: Interface FastEthernet0/19, changed state to administratively down
%LINK-5-CHANGED: Interface FastEthernet0/20, changed state to administratively down


